app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 68
---
     </table>
	 <%if !cart.line_items.empty?%>