app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "9"]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cart_id", 3], ["created_at", Thu, 16 Aug 2012 03:48:21 UTC +00:00], ["order_id", nil], ["product_id", 5], ["quantity", 1], ["updated_at", Thu, 16 Aug 2012 03:48:21 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-07-15 07:41:09.406250' WHERE "line_items"."id" = 79
---
 def create
 puts "******you are coming here ***"
@cart = current_cart
product = Product.find(params[:product_id])
@line_item = @cart.add_product(product.id)
respond_to do |format|
if @line_item.save