app/controllers/orders_controller.rb

def index
@orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
:per_page => 10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def new
@cart = current_cart
if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 69
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 69

  def create
@order = Order.new(params[:order])
@order.add_line_items_from_cart(current_cart)
respond_to do |format|
if @order.save
Cart.destroy(session[:cart_id])
session[:cart_id] = nil
Notifier.order_received(@order).deliver
---
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 69]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 69