app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
	 respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "hashed_password", "name", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"